In [7]:
import pandas as pd
items = {
    'Bob': pd.Series(data=[290, 250, 230], index=['bike', 'pants', 'watch']),
    'Alice': pd.Series(data=[40, 80, 97, 110], index=['book', 'glasses', 'bike', 'pants'])
}
items

{'Bob': bike     290
 pants    250
 watch    230
 dtype: int64, 'Alice': book        40
 glasses     80
 bike        97
 pants      110
 dtype: int64}

In [6]:
shopping_charts = pd.DataFrame(items)
shopping_charts

           Bob  Alice
bike     290.0   97.0
book       NaN   40.0
glasses    NaN   80.0
pants    250.0  110.0
watch    230.0    NaN

In [14]:
# We create a dictionary of Pandas Series without indexes
data = {
    'Bob': pd.Series([100, 100, 100]),
    'Alice': pd.Series([40, 40, 40])
}
df = pd.DataFrame(data)
df

   Bob  Alice
0  100     40
1  100     40
2  100     40

In [16]:
# We Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# We display bob_shopping_cart
bob_shopping_cart

       Bob
bike   290
pants  250
watch  230

In [17]:
# We Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

# We display sel_shopping_cart
sel_shopping_cart

         Bob  Alice
pants  250.0    110
book     NaN     40

In [18]:
# We Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])

# We display alice_sel_shopping_cart
alice_sel_shopping_cart

         Alice
glasses     80
bike        97

In [20]:
# create a dictionary from the list [arrays]
data = {
    'integers': [1, 10, 20],
    'Floats': [1.1, 10.1, 20.1]
}
df = pd.DataFrame(data)
df

   integers  Floats
0         1     1.1
1        10    10.1
2        20    20.1

In [21]:
# Create a dataframe and provide the row index
df = pd.DataFrame(data, index=['label1', 'label2', 'label3'])
df

        integers  Floats
label1         1     1.1
label2        10    10.1
label3        20    20.1

In [52]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2)

# We display the DataFrame
store_items

   bikes  pants  watches  glasses
0     20     30       35      NaN
1     15      5       10     50.0

In [58]:
# Accessing elements in dataframe
store_items = pd.DataFrame(items2, index=['store1', 'store2'])
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [61]:
store_items[['bikes']]
store_items.loc[['store1']]
store_items['bikes']['store2']
store_items
# adding a new column
# store_items['shirts'] = [15, 4]

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [69]:
# Adding colomns to dtaframe
# new_items = [{'bikes': 30, 'pants': 20, 'watches': 36, 'glasses': 4}]
# new_store = pd.DataFrame(new_items, index=['store3'])
# store_items = store_items.append(new_store)
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0
store3     30     20       36      4.0
store3     30     20       36      4.0
store3     30     20       36      4.0

In [72]:
# dataframe.insert(loc,label,data) method allows us to insert a new column in the dataframe at location loc, with the given column label, and given data
print(store_items)
store_items.insert(3, 'new Watches', [0, 9, 9, 9, 0])
store_items

        bikes  pants  watches  new Watches  glasses
store1     20     30       35            0      NaN
store2     15      5       10            9     50.0
store3     30     20       36            9      4.0
store3     30     20       36            9      4.0
store3     30     20       36            0      4.0

ValueError: cannot insert new Watches, already exists

In [74]:
# We remove the new watches column
store_items.pop('new Watches')

# we display the modified DataFrame
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0
store3     30     20       36      4.0
store3     30     20       36      4.0
store3     30     20       36      4.0

In [75]:
# We remove the store 2 and store 1 rows
store_items = store_items.drop(['store3'], axis = 0)

# we display the modified DataFrame
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [76]:
store_items = store_items.rename(index={'store1': 'First Store'})
store_items

             bikes  pants  watches  glasses
First Store     20     30       35      NaN
store2          15      5       10     50.0